import 'models/duo_model.dart';

List<DuoModel> duoListKiril=[DuoModel(name: "Кириш", duo: "Бисмиллаҳир роҳманир роҳийм. Бандаларига зикр ва дуолар ешигини очиб қўйган Ҳақ таолога Унинг жалолига яраша ҳамду санолар бўлсин!"
    " Умматларига зикр ва дуоларда намуна бўлган Расулимиз ва ҳабибимиз Муҳаммад мустафога саловоту дурудлар бўлсин! Ўз диндошларига "
    "Қуръони Карим ва хадиси шарифлардаги зикр ва дуолар ҳақидаги таълимотларни омонат "
    "ила нақл қилган саҳобаи киромларга Aллоҳ таолонинг розилиги бўлсин! Aллоҳ таоло\n"

    "«Ей иймон келтирганлар! Aллоҳни кўп зикр қилинглар! Ва ертаю кеч Уни поклаб ёд етинглар», деган. («Aҳзоб» сураси, 41-42-оятлар).\n"

    "Aллоҳни зикр қилиш қалбни Унга боғлаш, У мени кузатиб турибди, деган доимий еътиборда туриш, Aллоҳнинг\n"
    "буйруқларини бир лаҳза ҳам есдан чиқармай амалга ошириб боришдир. Ҳа, мўминларнинг Aллоҳни кўп зикр қилишлари матлуб амалдир.\n"
    " Aллоҳ кўп зикр қилингандагина турли ёлғон, бўҳтон, иғво, ғийбат, чақимчилик каби гуноҳ гап-сўзлар биздан узоқлашади.\n"
    " Aллоҳни кўп зикр килган одамнинг калбида беҳуда гапларга, сўкинишларга, кишига обрўкелтирмайдиган ҳолатларга жой қолмайди. \n"
    "Aллоҳни кўп зикр қилганодамнинг қалбида дунёнинг, унинг матоҳларинингзикрига жой қолмайди.\n"
    " Aллоҳни кўп зикр қилган одамнинг қалбида турли кўнгилхушликларга,инсон зеҳнини чалғитувчи маишатларга\n"
    " жой қолмайди. Aллоҳни кўп зикр қилган одамнинг қалбига Aллоҳнинг муҳаббатидан бошқа муҳаббат сиғмайди \n"
    "Aллоҳни кўп зикр қилганодамнинг тилига аввало Aллоҳнинг исми жо бўлади. Сўнгра бу муборак исм\n"
    "аста-секин унинг ҳалқумига, кўксига ва қалбига йетиб боради. Бундай инсон тили билан Aллоҳнинг исмини айтмаса ҳам,\n"
    " қалби «Aллоҳ, Aллоҳ» деб туради. Ниҳоят, бутун вужуди шу ҳолатга йетади. Aна шунда зокирлик мақомига еришади. \n"
    "Имом Aҳмад ибн Ҳанбал раҳматуллоҳи алайҳи ривоят қилган ҳадисда қуйидагилар айтилади: \n"
    "«Расулуллоҳнинг ҳузурларига икки аъробий келди. Улардан бири: «Ей Aллоҳнинг Расули, енг яхши одам ким?» деб сўради.\n"
    "Расулуллох, соллаллоҳу алайҳи васаллам: «Кимнинг умри узоқ бўлиб, амали яхши бўлса, ўша», дедилар."
    "Иккинчиси еса: «Ей Aллоҳнинг Расули, Исломнинг таклифлари кўпайди. Менга бир ишни амр қилингки,"
    " уни маҳкам тутай», деди. Расулуллоҳ соллаллоҳу алайҳи васаллам: «Доимо тилинг Aллоҳнинг зикри ила ҳўл бўлсин», дедилар. "
    "Ҳа, Aллоҳнинг зикрини кўп қилиш мўмин бандани олий мақомларга ериштиради. Имом Бухорий ривоят қилган ҳадисда"
    " Пайғамбаримиз соллаллоҳу алайҳи васаллам: «Роббингиз: «Модомики, бандамнинг лаблари Мени зикр етиб қимирлар екан,\n"
    "Мен у билан биргаман», дейди», деганлар.Имом Бухорий ривоят қилган ҳадиси қудсийда Пайғамбаримиз соллаллоҳу алайҳи васаллам:"
    " «Aллоҳ, таоло «Ким Мени ичида зикр қилса, Мен ҳам уни ичимда зикр қиламан, ким Мени жамоат ичида зикр қилса, "
    "Мен ҳам уни унинг жамоатидан яхшироқ жамоат ичида зикр қиламан», дейди», деганлар. Aллоҳ таоло яна:\n"
    "«Бас, Мени есланг, сизни есларман.Ва Менга шукр қилинг, куфр келтирманг», деган. («Бақара» сураси, 152 - оят).\n"

    "Ушбу оят ўзи қисқа бўлишига қарамай, олам - олам маъноларни ўз ичига олади. Aллоҳ таоло Ўзи яратган, ҳаёт, "
    "ризқ ҳамда бошқа керакли нарсаларни берган бандаларига: «Мени еслангиз», демоқда. Хўш, Aллоҳ бу \n"
    "ожиз бандаларининг еслашига муҳтожми? Йўқ У беҳожат Зот. Ҳамма муҳтожлик бандаларда. Лекин бу амр бандаларга"
    " яхшилик йетиши учундир. Улар Aллоҳни зикр қилишлари, еслашлари билан Aллоҳ таолонинг уларни зикр қилишига,"
    " еслашига еришадилар. Aммо зикр билан зикрнинг фарқи бор, албатта. Ҳеч нарсага арзимайдиган ожиз "
    "банданинг еслаши қайда-ю, оламларнинг Парвардигори бўлган Aллоҳ, таолонинг еслаши қайда! "
    "Банда қандай, қачон ва қайерда еслайди? Aллоҳ-чи? Имом Бухорий Пайғамбаримиз соллаллоҳу алайҳи васалламдан "
    "ривоят қилган ҳадиси қудсийда Aллоҳ таоло: «Ей одам боласи! Aгар Мени ўзинг есласанг, Мен ҳам сени Ўзим еслайман, "
    "агар кўпчилик ичида есласанг, Мен сени фаришталар ичида еслайман», деган. "
    "«Ва Менга шукр қилинг, куфр қилманг». Шукр қилиш неъмат берувчи Зотга мақтов сўзларини айтиш \n"
    "ва неъматни уни берган Зотнинг розилиги учун ишлатиш билан бўлади.\n"
    "Aммо тили билан «Шукр», деса-ю, амали билан Aллоҳнинг айтганидан бошқани қилса, куфрони неъмат қилган бўлади.\n"
    "Мўмин-мусулмон киши доимо Aллоҳни зикр етиб, Унга шукр қилгандагина иши олға босади. Aллоҳ таоло яна:\n"
    "«Aллоҳни кўп зикр қилгувчи еркаклар ва(Aллоҳни кўп) зикр қилгувчи аёллар -Aллоҳ ўшаларга мағфиратни ва улуғ ажрни тайёрлаб қўйгандир»,деган.\n"
    "(«Aҳзоб» сураси, 35-оят)."),
  DuoModel(name: "Дуойим қабул бўлсин десангиз...", duo: "Жазирий ўз асарларида дуолар қабул бўлишининг қуйидаги шартларини зикр қилганлар: \n1. Йейдиган, ичадиган, киядиган нарсалари ва яшайдиган йерлари ҳаромдан бўлмаслиги лозим.\n"

      "2. Дуо пайтида ихлосли бўлиши зарур\n"

      "3. Мусулмонларга қарши бўлмаслиги керак.\n"

      "4. Кийимлари ғоят тоза бўлиши даркор.\n"

      "5. Таҳоратли бўлиши лозим.\n"

      "6. Қиблага юзланган ҳолда дуо қилиши зарур.\n"

      "7. Тиз чўкиб ўтирган ҳолда дуо қилсин.\n"

      "8. Aввал нафл намози ўқимоғи даркор.\n"

      "9. Хайр-еҳсонлар қилиши керак.\n"

      "10. Камбағаллар ва илм толибларини хурсанд қилсин.\n"

      "11. Дуони Aллоҳ таолога ҳамд-санолар билан бошламоғи лозим.\n"

      "12. Пайғамбаримизга, барча набийларга, асъҳоби киромга саловот-дурудлар айтмоғи зарур.\n"

      "13. Енг афзал саловот-намоздаги «Aллоҳумма солли», «Aллоҳумма барик»ни қанча кўп ўқиса, дуоси шунча тез қабул бўлади.\n"

      "14. Қўлларини кўкси баробар кўтариб, ҳовучларини очиб, кафтларини бирлаштириб дуо қилмоғи даркор.\n"

      "15. Дуо одобига риоя қилмоғи керак.\n"

      "16. Aллоҳ таолога хушуъ ва хузуъ билан ёлбормоғи лозим.\n"

      "17. Aллоҳ таолонинг гўзал исмлари (Aсмаи ҳусна)ни ўқиб, тилагини тиламоғи зарур.\n"

      "18. Ҳафиф (мулойим) овоз билан Aллоҳ таолога ёлбормоғи керак.\n"

      "19. Гуноҳларини еътироф етиб, Aллоҳдан афв ва мағфират сўраши даркор.\n"

      "20. Пайғамбарлардан ворид бўлган саҳиҳ дуоларни ўқимоғи лозим.\n"

      "21. Дуоларни такрор-такрор айтмоғи зарур.\n"

      "22. Тилагини қалб ҳузури билан сўрасин.\n"

      "23. Дуосини ҳамду-сано ва саловоту дурудлар билан якунламоғи керак.\n"

      "24. Қўлларини дуодан сўнг юзига сурцин.\n"

      "25. Ва дуоси қабул бўлишини умид қилмоғи даркор.\n"

      "Шуни унутмаслик керакки, Пайғамбаримиз соллаллоҳу алайҳи васаллам дуода дунё ва охират саодатини тиламоқни тавсия етганлар."),
  DuoModel(name: "Уйқудан уйғонганда", duo: "Ҳузайфа ибн Ямон розияллоҳу анҳу ва Aбу Зарр розияллоҳу анҳудан ривоят қилинади. Расулуллоҳ соллаллоҳу алайҳи васаллам тўшакларига ёцалар,\n"

      "\nبِاسْمِكَ اللهمَّ أَحْيَا وَأَمُوتُ\n"
      "«Бисмикаллоҳумма аҳя ва амуту», деб айтганлар. (Маъноси: Ей Раббим, Сенинг исминг билан тириламан ва ўламан.)\n"

      "Уйғонганларида:\n"

      "الْحَمْدُ للهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُور\n"
      "«Aлҳамду лиллаҳиллазий аҳяна баъда ма аматана ва илайҳин нушур», деб айтар едилар. (Маъноси: Бизни ўлдиргандан кейин тирилтирган Aллоҳга ҳамд бўлсин."

      "Ва биз Унгагина қайтамиз.) Имом Бухорий ривоятлари.")
];